## Pruebas con pandas

### Series

In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame
from random import randint

In [2]:
s1 = Series([1,4,5,6,9])
s2 = Series(np.arange(10))

In [3]:
s1

0    1
1    4
2    5
3    6
4    9
dtype: int64

In [4]:
s3 = Series([1,2,3,4,5], index=list('abcde'))
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
s3['a'], s3[0], s3[-5]

(1, 1, 1)

In [6]:
s4 = s3[['a','b','d']]
s4

a    1
b    2
d    4
dtype: int64

In [7]:
s4 > 2

a    False
b    False
d     True
dtype: bool

In [8]:
s4 * 10

a    10
b    20
d    40
dtype: int64

In [9]:
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
s4 = Series([10,20,30,40,50], index=list('aeiou'))
s4

a    10
e    20
i    30
o    40
u    50
dtype: int64

In [11]:
suma = s3 + s4
suma

a    11.0
b     NaN
c     NaN
d     NaN
e    25.0
i     NaN
o     NaN
u     NaN
dtype: float64

In [12]:
suma = s3.add(s4, fill_value=0)
suma

a    11.0
b     2.0
c     3.0
d     4.0
e    25.0
i    30.0
o    40.0
u    50.0
dtype: float64

In [13]:
s3 + s3

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [14]:
s3 < s3

a    False
b    False
c    False
d    False
e    False
dtype: bool

In [15]:
suma[suma > 5]

a    11.0
e    25.0
i    30.0
o    40.0
u    50.0
dtype: float64

In [16]:
suma.isnull()

a    False
b    False
c    False
d    False
e    False
i    False
o    False
u    False
dtype: bool

### Dataframe

In [17]:
df1 = DataFrame(np.arange(25).reshape(5,5))
df1

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [18]:
df2 = DataFrame(np.arange(25).reshape(5,5), columns=list('abcde'))
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [19]:
# Una columna:
df2['a']

0     0
1     5
2    10
3    15
4    20
Name: a, dtype: int32

In [20]:
type(df2['a'])

pandas.core.series.Series

In [21]:
df2.a

0     0
1     5
2    10
3    15
4    20
Name: a, dtype: int32

In [22]:
df2.loc[2]

a    10
b    11
c    12
d    13
e    14
Name: 2, dtype: int32

In [23]:
# Celda
df2['e'][4]

24

In [24]:
df2.loc[4]['e']

24

In [25]:
df2[['b','d']]

    b   d
0   1   3
1   6   8
2  11  13
3  16  18
4  21  23

In [26]:
type(df2[['b','d']])

pandas.core.frame.DataFrame

In [27]:
d = {letra:[randint(1,10) for _ in range(8)] for letra in "aeiou"}
for k,L in d.items():
    print(k, L)

a [4, 6, 5, 1, 8, 8, 6, 7]
e [4, 3, 7, 5, 2, 3, 8, 8]
i [5, 1, 4, 8, 10, 9, 7, 1]
o [8, 5, 10, 1, 3, 2, 9, 3]
u [9, 8, 3, 2, 1, 4, 8, 10]

In [28]:
df2 = DataFrame(d)
df2

   a  e   i   o   u
0  4  4   5   8   9
1  6  3   1   5   8
2  5  7   4  10   3
3  1  5   8   1   2
4  8  2  10   3   1
5  8  3   9   2   4
6  6  8   7   9   8
7  7  8   1   3  10

### DataFrame desde ficheros, funciones típicas

In [29]:
path = "../../practicas/avanzado2/pandas/merge/Pedidos.txt"

In [30]:
df = pd.read_csv(path, sep=';')
df

     idpedido cliente  idempleado  idempresa  importe            pais
0       10248   WILMK           5          3    32.38       Finlandia
1       10249   TOMSP           6          1    11.61        Alemania
2       10250   HANAR           4          2    65.83          Brasil
3       10251   VICTE           3          1    41.34         Francia
4       10252   SUPRD           4          2    51.30         Belgica
..        ...     ...         ...        ...      ...             ...
825     11073   PERIC           2          2    24.95          Mexico
826     11074   SIMOB           7          2    18.44       Dinamarca
827     11075   RICSU           8          2     6.19           Suiza
828     11076   BONAP           4          2    38.28         Francia
829     11077   RATTC           1          2     8.53  Estados Unidos

[830 rows x 6 columns]

In [31]:
df.head(3)

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil

In [32]:
df.tail(5)

     idpedido cliente  idempleado  idempresa  importe            pais
825     11073   PERIC           2          2    24.95          Mexico
826     11074   SIMOB           7          2    18.44       Dinamarca
827     11075   RICSU           8          2     6.19           Suiza
828     11076   BONAP           4          2    38.28         Francia
829     11077   RATTC           1          2     8.53  Estados Unidos

In [33]:
df.shape

(830, 6)

In [34]:
filas, cols = df.shape
filas

830

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   idpedido    830 non-null    int64
 1   cliente     830 non-null    object
 2   idempleado  830 non-null    int64
 3   idempresa   830 non-null    int64
 4   importe     830 non-null    float64
 5   pais        830 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 39.0+ KB

In [36]:
df.describe()

           idpedido  idempleado   idempresa      importe
count    830.000000  830.000000  830.000000   830.000000
mean   10662.500000    4.403614    2.008434    78.244205
std      239.744656    2.499648    0.778899   116.779294
min    10248.000000    1.000000    1.000000     0.020000
25%    10455.250000    2.000000    1.000000    13.380000
50%    10662.500000    4.000000    2.000000    41.360000
75%    10869.750000    7.000000    3.000000    91.430000
max    11077.000000    9.000000    3.000000  1007.640000

#### Agrupar y operar con columnas

In [37]:
df.pais.value_counts()

pais
Estados Unidos    123
Alemania          122
Brasil             83
Francia            76
Reino Unido        55
Venezuela          46
Austria            40
Suecia             38
Canada             30
Mexico             28
Italia             28
Espanya            23
Finlandia          23
Irlanda            19
Belgica            19
Suiza              18
Dinamarca          18
Argentina          16
Portugal           13
Polonia             6
Noruega             6
Name: count, dtype: int64

In [59]:
df.cliente.value_counts()

cliente
SAVEA    31
ERNSH    30
QUICK    28
HUNGO    19
BERGS    19
         ..
THECR     3
FRANR     3
LAZYK     2
GROSR     2
CENTC     1
Name: count, Length: 89, dtype: int64

##### Group by

In [60]:
grupo1 = df.importe.groupby(df.pais)
grupo1

In [61]:
print('La media: ')
grupo1.mean()

La media:

pais
Alemania           92.485902
Argentina          37.411250
Austria           184.787500
Belgica            67.375789
Brasil             58.797470
Canada             73.269667
Dinamarca          77.566111
Espanya            37.473478
Estados Unidos    112.059593
Finlandia          41.011739
Francia            55.335000
Irlanda           145.012632
Italia             30.872857
Mexico             40.099286
Noruega            45.916667
Polonia            27.283333
Portugal           49.502308
Reino Unido        53.514727
Suecia             85.488421
Suiza              76.029444
Venezuela          59.460435
Name: importe, dtype: float64

In [66]:
# Mínimo de cada país:
minimo = grupo1.min()
print(minimo['Alemania'])
print(minimo.values)
print(minimo.index)

0.15
[ 0.15  0.33  5.29  0.17  0.14  0.94  2.92  1.25  0.2   0.59  0.02 16.74
  0.48  0.4   4.62  3.94  1.27  0.9   1.23  1.17  0.12]
Index(['Alemania', 'Argentina', 'Austria', 'Belgica', 'Brasil', 'Canada',
       'Dinamarca', 'Espanya', 'Estados Unidos', 'Finlandia', 'Francia',
       'Irlanda', 'Italia', 'Mexico', 'Noruega', 'Polonia', 'Portugal',
       'Reino Unido', 'Suecia', 'Suiza', 'Venezuela'],
      dtype='object', name='pais')

In [69]:
grupo2 = df.importe.groupby([df.pais, df.cliente])
grupo2.mean()

pais       cliente
Alemania   ALFKI       37.596667
           BLAUS       24.037143
           DRACD       51.006667
           FRANK       93.562667
           KOENE       58.120000
                         ...
Suiza      RICSU      100.129000
Venezuela  GROSR       33.900000
           HILAA       69.953333
           LILAS       52.457857
           LINOD       56.150833
Name: importe, Length: 89, dtype: float64

In [73]:
grupo2.indices

{('Alemania', 'ALFKI'): array([395, 444, 454, 587, 704, 763], dtype=int64),
 ('Alemania',
  'BLAUS'): array([253, 261, 334, 366, 605, 708, 810], dtype=int64),
 ('Alemania', 'DRACD'): array([115, 143, 549, 577, 788, 819], dtype=int64),
 ('Alemania',
  'FRANK'): array([ 19,  89,  94, 148, 240, 312, 375, 405, 422, 427, 469, 543, 611,
        681, 764], dtype=int64),
 ('Alemania',
  'KOENE'): array([ 75,  77, 208, 209, 220, 258, 294, 382, 470, 551, 569, 601, 645,
        780], dtype=int64),
 ('Alemania',
  'LEHMS'): array([ 31,  36,  95, 249, 274, 286, 288, 309, 344, 345, 524, 614, 643,
        686, 822], dtype=int64),
 ('Alemania', 'MORGK'): array([ 29, 327, 451, 531, 697], dtype=int64),
 ('Alemania',
  'OTTIK'): array([ 12, 159, 260, 306, 332, 436, 518, 585, 751, 772], dtype=int64),
 ('Alemania',
  'QUICK'): array([ 25,  37,  38,  65,  97, 113, 170, 203, 267, 279, 292, 301, 340,
        410, 443, 446, 473, 497, 517, 540, 597, 617, 630, 690, 714, 743,
        748, 773], dtype=int64),
 ('Alemania', 'TOMSP'): array([  1, 190, 198, 300, 360, 719], dtype=int64),
 ('Alemania',
  'WANDK'): array([ 53,  64, 100, 108, 265, 384, 392, 403, 420, 798], dtype=int64),
 ('Argentina', 'CACTU'): array([273, 534, 571, 633, 689, 806], dtype=int64),
 ('Argentina', 'OCEAN'): array([161, 283, 650, 710, 738], dtype=int64),
 ('Argentina', 'RANCH'): array([200, 468, 580, 668, 771], dtype=int64),
 ('Austria',
  'ERNSH'): array([ 10,  15, 103, 120, 134, 142, 154, 155, 182, 194, 266, 323, 347,
        385, 419, 450, 516, 523, 525, 528, 547, 588, 606, 647, 720, 731,
        742, 760, 769, 824], dtype=int64),
 ('Austria',
  'PICCO'): array([105, 144, 179, 241, 282, 349, 438, 499, 596, 805], dtype=int64),
 ('Belgica', 'MAISD'): array([281, 401, 512, 644, 648, 730, 756], dtype=int64),
 ('Belgica',
  'SUPRD'): array([  4,  54, 210, 215, 227, 519, 593, 598, 637, 682, 787, 790],
       dtype=int64),
 ('Brasil', 'COMMI'): array([ 42, 218, 246, 721, 794], dtype=int64),
 ('Brasil', 'FAMIA'): array([ 99, 138, 166, 264, 333, 402, 477], dtype=int64),
 ('Brasil',
  'GOURL'): array([175, 404, 437, 461, 486, 529, 542, 711, 801], dtype=int64),
 ('Brasil',
  'HANAR'): array([  2,   5, 293, 397, 442, 522, 535, 638, 655, 674, 677, 733, 774,
        804], dtype=int64),
 ('Brasil',
  'QUEDE'): array([ 13,  43, 131, 173, 339, 399, 472, 546, 741], dtype=int64),
 ('Brasil',
  'QUEEN'): array([124, 158, 239, 389, 411, 456, 480, 538, 620, 665, 666, 713, 820],
       dtype=int64),
 ('Brasil',
  'RICAR'): array([ 39,  51, 199, 233, 315, 374, 400, 565, 603, 629, 811], dtype=int64),
 ('Brasil', 'TRADH'): array([ 44, 248, 358, 582, 586, 591], dtype=int64),
 ('Brasil',
  'WELLI'): array([  8, 172, 337, 396, 555, 561, 652, 657, 687], dtype=int64),
 ('Canada',
  'BOTTM'): array([141, 162, 163, 183, 244, 494, 670, 696, 701, 727, 734, 779, 797,
        800], dtype=int64),
 ('Canada', 'LAUGB'): array([247, 372, 562], dtype=int64),
 ('Canada',
  'MEREP'): array([ 84,  91, 128, 176, 191, 257, 317, 322, 342, 357, 370, 371, 476],
       dtype=int64),
 ('Dinamarca',
  'SIMOB'): array([ 93, 169, 308, 394, 421, 554, 826], dtype=int64),
 ('Dinamarca',
  'VAFFE'): array([119, 151, 217, 343, 354, 440, 496, 521, 673, 698, 746], dtype=int64),
 ('Espanya', 'BOLID'): array([ 78, 553, 722], dtype=int64),
 ('Espanya', 'GALED'): array([118, 178, 320, 639, 680], dtype=int64),
 ('Espanya',
  'GODOS'): array([ 55, 302, 381, 624, 626, 640, 663, 700, 761, 789], dtype=int64),
 ('Espanya', 'ROMEY'): array([ 33,  34,  58, 669, 765], dtype=int64),
 ('Estados Unidos',
  'GREAL'): array([280, 341, 368, 369, 408, 433, 568, 688, 758, 792, 813], dtype=int64),
 ('Estados Unidos', 'HUNGC'): array([127, 146, 167, 352, 412], dtype=int64),
 ('Estados Unidos', 'LAZYK'): array([234, 297], dtype=int64),
 ('Estados Unidos', 'LETSS'): array([331, 471, 487, 636], dtype=int64),
 ('Estados Unidos',
  'LONEP'): array([ 59,  69, 296, 414, 417, 619, 635, 770], dtype=int64),
 ('Estados Unidos',
  'OLDWO'): array([ 57,  90, 193, 346, 432, 458, 560, 607, 717, 786], dtype=int64),
 ('Estados Unidos',
  'RATTC'): array([ 14,  24,  46,  66,  68,  98, 153, 231, 316, 321, 350, 513, 572,
        604, 641, 740, 752, 829], dtype=int64),
 ('Estados Unidos',
  'SAVEA'): array([ 76, 145, 150, 192, 204, 262, 307, 355, 359, 364, 379, 409, 430,
        452, 463, 465, 466, 474, 500, 509, 567, 599, 634, 646, 693, 735,
        736, 754, 782, 783, 816], dtype=int64),
 ('Estados Unidos',
  'SPLIR'): array([ 23,  81, 101, 121, 137, 184, 508, 573, 726], dtype=int64),
 ('Estados Unidos', 'THEBI'): array([ 62, 460, 557, 744], dtype=int64),
 ('Estados Unidos', 'THECR'): array([376, 527, 755], dtype=int64),
 ('Estados Unidos', 'TRAIH'): array([326, 329, 574], dtype=int64),
 ('Estados Unidos',
  'WHITC'): array([ 21,  96, 221, 235, 256, 348, 445, 448, 475, 492, 613, 622, 656,
        784, 818], dtype=int64),
 ('Finlandia',
  'WARTH'): array([ 18,  22,  72,  85, 164, 168, 189, 207, 278, 305, 335, 388, 502,
        533, 777], dtype=int64),
 ('Finlandia',
  'WILMK'): array([  0, 367, 425, 447, 625, 631, 662, 757], dtype=int64),
 ('Francia',
  'BLONP'): array([ 17,  49, 112, 188, 201, 311, 318, 336, 380, 431, 578], dtype=int64),
 ('Francia',
  'BONAP'): array([ 83,  92, 114, 222, 263, 277, 415, 467, 482, 484, 507, 579, 623,
        628, 684, 692, 828], dtype=int64),
 ('Francia', 'DUMON'): array([ 63, 361, 435, 642], dtype=int64),
 ('Francia', 'FOLIG'): array([160, 232, 386, 515, 541], dtype=int64),
 ('Francia', 'FRANR'): array([423, 612, 723], dtype=int64),
 ('Francia', 'LACOR'): array([610, 679, 724, 725], dtype=int64),
 ('Francia',
  'LAMAI'): array([102, 110, 123, 165, 177, 206, 245, 252, 362, 383, 539, 584, 675,
        803], dtype=int64),
 ('Francia', 'SPECD'): array([490, 659, 716, 795], dtype=int64),
 ('Francia',
  'VICTE'): array([  3,  86, 202, 211, 230, 298, 558, 566, 595, 602], dtype=int64),
 ('Francia', 'VINET'): array([ 26,  47, 489, 491], dtype=int64),
 ('Irlanda',
  'HUNGO'): array([ 50,  61,  87, 125, 132, 181, 255, 268, 319, 398, 413, 439, 453,
        464, 488, 649, 664, 737, 815], dtype=int64),
 ('Italia', 'FRANS'): array([174, 462, 505, 559, 778, 812], dtype=int64),
 ('Italia',
  'MAGAA'): array([ 27,  52, 156, 219, 387, 506, 536, 570, 691, 702], dtype=int64),
 ('Italia',
  'REGGC'): array([ 40, 180, 195, 314, 338, 407, 479, 564, 660, 694, 762, 814],
       dtype=int64),
 ('Mexico', 'ANATR'): array([ 60, 377, 511, 678], dtype=int64),
 ('Mexico', 'ANTON'): array([117, 259, 287, 325, 429, 434, 608], dtype=int64),
 ('Mexico', 'CENTC'): array([11], dtype=int64),
 ('Mexico', 'PERIC'): array([ 74, 106, 226, 254, 747, 825], dtype=int64),
 ('Mexico',
  'TORTU'): array([ 28,  45,  56,  71, 270, 328, 428, 594, 667, 821], dtype=int64),
 ('Noruega', 'SANTG'): array([139, 272, 391, 583, 661, 767], dtype=int64),
 ('Polonia', 'WOLZA'): array([126, 363, 544, 658, 750, 796], dtype=int64),
 ('Portugal',
  'FURIB'): array([ 80, 104, 216, 243, 303, 356, 416, 715], dtype=int64),
 ('Portugal', 'PRINI'): array([ 88, 149, 185, 229, 759], dtype=int64),
 ('Reino Unido',
  'AROUT'): array([107, 135, 205, 310, 459, 495, 520, 545, 616, 672, 705, 768],
       dtype=int64),
 ('Reino Unido',
  'BSBEV'): array([ 41, 223, 236, 290, 291, 330, 351, 695, 699, 775], dtype=int64),
 ('Reino Unido', 'CONSH'): array([187, 214, 600], dtype=int64),
 ('Reino Unido',
  'EASTC'): array([116, 152, 284, 478, 739, 776, 799, 808], dtype=int64),
 ('Reino Unido',
  'ISLAT'): array([ 67,  70,  73, 225, 373, 426, 501, 550, 581, 685], dtype=int64),
 ('Reino Unido', 'NORTS'): array([269, 504, 809], dtype=int64),
 ('Reino Unido',
  'SEVES'): array([111, 129, 140, 224, 275, 299, 552, 556, 621], dtype=int64),
 ('Suecia',
  'BERGS'): array([ 30,  32, 136, 196, 197, 276, 324, 378, 406, 424, 441, 485, 493,
        530, 589, 609, 618, 627, 676], dtype=int64),
 ('Suecia',
  'FOLKO'): array([ 16,  79, 130, 186, 212, 285, 313, 455, 514, 526, 576, 632, 654,
        707, 729, 732, 745, 753, 802], dtype=int64),
 ('Suiza',
  'CHOPS'): array([  6, 122, 271, 483, 498, 718, 781, 793], dtype=int64),
 ('Suiza',
  'RICSU'): array([  7, 171, 289, 418, 503, 510, 683, 703, 785, 827], dtype=int64),
 ('Venezuela', 'GROSR'): array([ 20, 537], dtype=int64),
 ('Venezuela',
  'HILAA'): array([  9, 147, 228, 238, 242, 250, 304, 353, 365, 393, 457, 548, 615,
        653, 709, 712, 728, 807], dtype=int64),
 ('Venezuela',
  'LILAS'): array([ 35,  48,  82, 109, 133, 213, 251, 295, 532, 575, 651, 749, 817,
        823], dtype=int64),
 ('Venezuela',
  'LINOD'): array([157, 237, 390, 449, 481, 563, 590, 592, 671, 706, 766, 791],
       dtype=int64)}

Crear columnas y operar:

In [38]:
df.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [39]:
df['porc_iva'] = 21.0

In [40]:
df.head()

   idpedido cliente  idempleado  idempresa  importe       pais  porc_iva
0     10248   WILMK           5          3    32.38  Finlandia      21.0
1     10249   TOMSP           6          1    11.61   Alemania      21.0
2     10250   HANAR           4          2    65.83     Brasil      21.0
3     10251   VICTE           3          1    41.34    Francia      21.0
4     10252   SUPRD           4          2    51.30    Belgica      21.0

In [41]:
df['iva'] = round(df.importe * df.porc_iva / 100, 2)

In [42]:
df['total'] = round(df.iva + df.importe, 2)

In [43]:
df.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,porc_iva,iva,total
0,10248,WILMK,5,3,32.38,Finlandia,21.0,6.80,39.18
1,10249,TOMSP,6,1,11.61,Alemania,21.0,2.44,14.05
2,10250,HANAR,4,2,65.83,Brasil,21.0,13.82,79.65
3,10251,VICTE,3,1,41.34,Francia,21.0,8.68,50.02
4,10252,SUPRD,4,2,51.30,Belgica,21.0,10.77,62.07

In [44]:
df2 = df[['idpedido','cliente','importe','porc_iva','iva','total','pais']]
df2.head()

   idpedido cliente  importe  porc_iva    iva  total       pais
0     10248   WILMK    32.38      21.0   6.80  39.18  Finlandia
1     10249   TOMSP    11.61      21.0   2.44  14.05   Alemania
2     10250   HANAR    65.83      21.0  13.82  79.65     Brasil
3     10251   VICTE    41.34      21.0   8.68  50.02    Francia
4     10252   SUPRD    51.30      21.0  10.77  62.07    Belgica

In [45]:
# Exportar a CSV (con Excel en español)
path_salida = "../../practicas/avanzado2/pandas/merge/csv"
df2.to_csv(path_salida+"/Pedidos.csv", sep=';', index=False, decimal=',')

In [46]:
# Para filtrar filas: Pedidos de Suiza 
dfSuiza = df2[(df2.pais == 'Suiza') & (df2.total > 100.0)]
dfSuiza

     idpedido cliente  importe  porc_iva    iva   total   pais
7       10255   RICSU   148.33      21.0  31.15  179.48  Suiza
171     10419   RICSU   137.35      21.0  28.84  166.19  Suiza
271     10519   CHOPS    91.76      21.0  19.27  111.03  Suiza
418     10666   RICSU   232.42      21.0  48.81  281.23  Suiza
483     10731   CHOPS    96.65      21.0  20.30  116.95  Suiza
503     10751   RICSU   130.79      21.0  27.47  158.26  Suiza
510     10758   RICSU   138.17      21.0  29.02  167.19  Suiza
785     11033   RICSU    84.74      21.0  17.80  102.54  Suiza

In [47]:
np.sum(dfSuiza.total)

1282.87

In [48]:
# Valores únicos de una columna
L = df.pais.unique()
L

array(['Finlandia', 'Alemania', 'Brasil', 'Francia', 'Belgica', 'Suiza',
       'Venezuela', 'Austria', 'Mexico', 'Estados Unidos', 'Suecia',
       'Italia', 'Espanya', 'Reino Unido', 'Irlanda', 'Portugal',
       'Canada', 'Dinamarca', 'Polonia', 'Noruega', 'Argentina'],
      dtype=object)

In [49]:
len(L)

21

Práctica: Exportar los pedidos de cada país a un fichero distinto.

In [50]:
for pais in L:
    
    # Generar la ruta del fichero destino
    path_file = f"../../practicas/avanzado2/pandas/merge/csv/{pais}.xlsx"
    print('Generando fichero: ', path_file)
    
    # Filtrar por países en Pedidos:
    dfPais = df[df.pais==pais]
    
    # Obtener número de filas
    print(dfPais.shape)
    
    # Grabar a Excel:
    dfPais.to_excel(path_file, index=False)
    print()

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Finlandia.xlsx
(23, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Alemania.xlsx
(122, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Brasil.xlsx
(83, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Francia.xlsx
(76, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Belgica.xlsx
(19, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Suiza.xlsx
(18, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Venezuela.xlsx
(46, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Austria.xlsx
(40, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Mexico.xlsx
(28, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Estados Unidos.xlsx
(123, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Suecia.xlsx
(38, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Italia.xlsx
(28, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Espanya.xlsx
(23, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Reino Unido.xlsx
(55, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Irlanda.xlsx
(19, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Portugal.xlsx
(13, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Canada.xlsx
(30, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Dinamarca.xlsx
(18, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Polonia.xlsx
(6, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Noruega.xlsx
(6, 9)

Generando fichero:  ../../practicas/avanzado2/pandas/merge/csv/Argentina.xlsx
(16, 9)

### Pandas merge

Montar un dataframe fusionando los ficheros de pedidos, empleados y empresas

In [51]:
path = "../../practicas/avanzado2/pandas/merge/"
dfPed = pd.read_csv(path+"Pedidos.txt", sep=';')
dfPed.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [52]:
dfEmpr = pd.read_csv(path+"Empresas.txt", sep=';')
dfEmpr.head()

   id           empresa
0   1    Speedy Express
1   2    United Package
2   3  Federal Shipping

In [53]:
dfEmpl = pd.read_csv(path+"Empleados.txt", sep=';')
dfEmpl.head()

   id     nombre                     cargo
0   1    Davolio   Representante de ventas
1   2     Fuller  Vicepresidente comercial
2   3  Leverling   Representante de ventas
3   4    Peacock   Representante de ventas
4   5   Buchanan         Gerente de ventas

In [54]:
dfPedEmpr = pd.merge(dfPed, dfEmpr, left_on="idempresa", right_on="id")
dfPedEmpr.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,id,empresa
0,10248,WILMK,5,3,32.38,Finlandia,3,Federal Shipping
1,10255,RICSU,9,3,148.33,Suiza,3,Federal Shipping
2,10257,HILAA,4,3,81.91,Venezuela,3,Federal Shipping
3,10259,CENTC,4,3,3.25,Mexico,3,Federal Shipping
4,10262,RATTC,8,3,48.29,Estados Unidos,3,Federal Shipping

In [55]:
dfPedEmpr.tail()

,idpedido,cliente,idempleado,idempresa,importe,pais,id,empresa
825,11073,PERIC,2,2,24.95,Mexico,2,United Package
826,11074,SIMOB,7,2,18.44,Dinamarca,2,United Package
827,11075,RICSU,8,2,6.19,Suiza,2,United Package
828,11076,BONAP,4,2,38.28,Francia,2,United Package
829,11077,RATTC,1,2,8.53,Estados Unidos,2,United Package

In [56]:
dfTotal = pd.merge(dfPedEmpr, dfEmpl, left_on="idempleado", right_on="id")
dfTotal.head()

,idpedido,cliente,idempleado,idempresa,importe,pais,id_x,empresa,id_y,nombre,cargo
0,10248,WILMK,5,3,32.38,Finlandia,3,Federal Shipping,5,Buchanan,Gerente de ventas
1,10320,WARTH,5,3,34.57,Finlandia,3,Federal Shipping,5,Buchanan,Gerente de ventas
2,10333,WARTH,5,3,0.59,Finlandia,3,Federal Shipping,5,Buchanan,Gerente de ventas
3,10359,SEVES,5,3,288.43,Reino Unido,3,Federal Shipping,5,Buchanan,Gerente de ventas
4,10378,FOLKO,5,3,5.44,Suecia,3,Federal Shipping,5,Buchanan,Gerente de ventas

In [57]:
# Borrar cols:
dfTotal.drop(columns=['idempleado','idempresa','id_x','id_y'], inplace=True)
dfTotal.head()

,idpedido,cliente,importe,pais,empresa,nombre,cargo
0,10248,WILMK,32.38,Finlandia,Federal Shipping,Buchanan,Gerente de ventas
1,10320,WARTH,34.57,Finlandia,Federal Shipping,Buchanan,Gerente de ventas
2,10333,WARTH,0.59,Finlandia,Federal Shipping,Buchanan,Gerente de ventas
3,10359,SEVES,288.43,Reino Unido,Federal Shipping,Buchanan,Gerente de ventas
4,10378,FOLKO,5.44,Suecia,Federal Shipping,Buchanan,Gerente de ventas

In [58]:
dfTotal.rename(columns={"nombre":"empleado"}, inplace=True)
dfTotal.head()

,idpedido,cliente,importe,pais,empresa,empleado,cargo
0,10248,WILMK,32.38,Finlandia,Federal Shipping,Buchanan,Gerente de ventas
1,10320,WARTH,34.57,Finlandia,Federal Shipping,Buchanan,Gerente de ventas
2,10333,WARTH,0.59,Finlandia,Federal Shipping,Buchanan,Gerente de ventas
3,10359,SEVES,288.43,Reino Unido,Federal Shipping,Buchanan,Gerente de ventas
4,10378,FOLKO,5.44,Suecia,Federal Shipping,Buchanan,Gerente de ventas